#Задача 26:  Напишите программу, которая на вход принимает два числа A и B, и возводит число А в целую степень 
#B с помощью рекурсии.
#*Пример:*
#A = 3; B = 5 -> 243 (3⁵)
#A = 2; B = 3 -> 8 
def rec(n,b):
    if b == 0:
        return 1
    return n * rec(n, b-1)
n = int(input())
b = int(input())
print(rec(n, b))
